; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	satellite4 - satellite
	instrument10 - instrument
	satellite5 - satellite
	instrument11 - instrument
	satellite6 - satellite
	instrument12 - instrument
	instrument13 - instrument
	instrument14 - instrument
	satellite7 - satellite
	instrument15 - instrument
	instrument16 - instrument
	satellite8 - satellite
	instrument17 - instrument
	instrument18 - instrument
	instrument19 - instrument
	spectrograph3 - mode
	spectrograph1 - mode
	spectrograph2 - mode
	spectrograph0 - mode
	Star2 - direction
	GroundStation1 - direction
	Star3 - direction
	GroundStation0 - direction
	GroundStation5 - direction
	Star4 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 spectrograph3)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 spectrograph1)
	(supports instrument2 spectrograph3)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star8)
	(supports instrument3 spectrograph0)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 Star2)
	(calibration_target instrument3 GroundStation5)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star11)
	(supports instrument4 spectrograph0)
	(supports instrument4 spectrograph3)
	(supports instrument4 spectrograph1)
	(calibration_target instrument4 Star3)
	(calibration_target instrument4 Star2)
	(supports instrument5 spectrograph1)
	(supports instrument5 spectrograph2)
	(supports instrument5 spectrograph3)
	(calibration_target instrument5 GroundStation5)
	(supports instrument6 spectrograph1)
	(supports instrument6 spectrograph0)
	(supports instrument6 spectrograph3)
	(calibration_target instrument6 GroundStation5)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star11)
	(supports instrument7 spectrograph0)
	(supports instrument7 spectrograph1)
	(supports instrument7 spectrograph2)
	(calibration_target instrument7 GroundStation0)
	(supports instrument8 spectrograph0)
	(calibration_target instrument8 GroundStation0)
	(calibration_target instrument8 GroundStation1)
	(supports instrument9 spectrograph1)
	(supports instrument9 spectrograph2)
	(calibration_target instrument9 Star2)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star3)
	(supports instrument10 spectrograph2)
	(supports instrument10 spectrograph1)
	(supports instrument10 spectrograph0)
	(calibration_target instrument10 GroundStation5)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star8)
	(supports instrument11 spectrograph2)
	(supports instrument11 spectrograph3)
	(calibration_target instrument11 Star3)
	(calibration_target instrument11 Star2)
	(on_board instrument11 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Planet10)
	(supports instrument12 spectrograph2)
	(supports instrument12 spectrograph3)
	(calibration_target instrument12 Star3)
	(calibration_target instrument12 GroundStation5)
	(supports instrument13 spectrograph2)
	(calibration_target instrument13 Star4)
	(calibration_target instrument13 GroundStation1)
	(supports instrument14 spectrograph1)
	(supports instrument14 spectrograph3)
	(calibration_target instrument14 GroundStation0)
	(calibration_target instrument14 Star4)
	(on_board instrument12 satellite6)
	(on_board instrument13 satellite6)
	(on_board instrument14 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Phenomenon6)
	(supports instrument15 spectrograph3)
	(supports instrument15 spectrograph2)
	(calibration_target instrument15 Star3)
	(supports instrument16 spectrograph2)
	(supports instrument16 spectrograph3)
	(supports instrument16 spectrograph0)
	(calibration_target instrument16 GroundStation0)
	(calibration_target instrument16 GroundStation5)
	(on_board instrument15 satellite7)
	(on_board instrument16 satellite7)
	(power_avail satellite7)
	(pointing satellite7 GroundStation5)
	(supports instrument17 spectrograph0)
	(supports instrument17 spectrograph1)
	(supports instrument17 spectrograph2)
	(calibration_target instrument17 GroundStation0)
	(calibration_target instrument17 Star4)
	(supports instrument18 spectrograph1)
	(supports instrument18 spectrograph3)
	(supports instrument18 spectrograph2)
	(calibration_target instrument18 GroundStation5)
	(supports instrument19 spectrograph2)
	(supports instrument19 spectrograph0)
	(supports instrument19 spectrograph3)
	(calibration_target instrument19 Star4)
	(on_board instrument17 satellite8)
	(on_board instrument18 satellite8)
	(on_board instrument19 satellite8)
	(power_avail satellite8)
	(pointing satellite8 Star2)
)
(:goal (and
	(pointing satellite0 Phenomenon9)
	(pointing satellite1 Phenomenon9)
	(pointing satellite2 Star4)
	(pointing satellite3 Star8)
	(have_image Phenomenon6 spectrograph2)
	(have_image Phenomenon7 spectrograph1)
	(have_image Star8 spectrograph1)
	(have_image Phenomenon9 spectrograph3)
	(have_image Planet10 spectrograph3)
	(have_image Star11 spectrograph0)
))

)

; plan
1. (turn_to satellite3 groundstation0 star3)
   deleted: (pointing satellite3 star3)
   added: (pointing satellite3 groundstation0)
   goals met: 0 of 10
2. (switch_on instrument7 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument7)
   goals met: 0 of 10
3. (calibrate satellite3 instrument7 groundstation0)
   added: (calibrated instrument7)
   goals met: 0 of 10
4. (turn_to satellite3 phenomenon7 groundstation0)
   deleted: (pointing satellite3 groundstation0)
   added: (pointing satellite3 phenomenon7)
   goals met: 0 of 10
5. (take_image satellite3 phenomenon7 instrument7 spectrograph1)
   added: (have_image phenomenon7 spectrograph1)
   goals met: 1 of 10
6. (turn_to satellite3 phenomenon6 phenomenon7)
   deleted: (pointing satellite3 phenomenon7)
   added: (pointing satellite3 phenomenon6)
   goals met: 1 of 10
7. (turn_to satellite2 star4 star11)
   deleted: (pointing satellite2 star11)
   added: (pointing satellite2 star4)
   goals met: 2 of 10
8. (turn_to satellite1 phenomenon9 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 phenomenon9)
   goals met: 3 of 10
9. (turn_to satellite0 groundstation0 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 groundstation0)
   goals met: 3 of 10
10. (take_image satellite3 phenomenon6 instrument7 spectrograph2)
   added: (have_image phenomenon6 spectrograph2)
   goals met: 4 of 10
11. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 4 of 10
12. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 4 of 10
13. (turn_to satellite0 planet10 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 planet10)
   goals met: 4 of 10
14. (take_image satellite0 planet10 instrument0 spectrograph3)
   added: (have_image planet10 spectrograph3)
   goals met: 5 of 10
15. (turn_to satellite0 phenomenon9 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 phenomenon9)
   goals met: 6 of 10
16. (take_image satellite0 phenomenon9 instrument0 spectrograph3)
   added: (have_image phenomenon9 spectrograph3)
   goals met: 7 of 10
17. (turn_to satellite3 star11 phenomenon6)
   deleted: (pointing satellite3 phenomenon6)
   added: (pointing satellite3 star11)
   goals met: 7 of 10
18. (take_image satellite3 star11 instrument7 spectrograph0)
   added: (have_image star11 spectrograph0)
   goals met: 8 of 10
19. (turn_to satellite3 star8 star11)
   deleted: (pointing satellite3 star11)
   added: (pointing satellite3 star8)
   goals met: 9 of 10
20. (take_image satellite3 star8 instrument7 spectrograph1)
   added: (have_image star8 spectrograph1)
   goals met: 10 of 10
